## Plan Result (demo-global)




<pre><code>Plan: 24 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;div-da&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;div-dn&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;div-pfe&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;div-rfe&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;et-sya&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;fact&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;fact-admin&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;paybubble&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;paybubble-int&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;paymentoutcome-web&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;paymentoutcome-web-int&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https_www_redirect[&#34;paymentoutcome-web&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https_www_redirect[&#34;paymentoutcome-web-int&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;div-da&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;div-dn&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;div-pfe&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;div-rfe&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;et-sya&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;fact&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;fact-admin&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;paybubble&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;paybubble-int&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;paymentoutcome-web&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;paymentoutcome-web-int&#34;]
* Update
  * module.landing_zone.azurerm_frontdoor.main
  * module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor.main will be updated in-place
  ~ resource "azurerm_frontdoor" "main" {
        id                                   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo"
        name                                 = "hmcts-demo"
        tags                                 = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (11 unchanged attributes hidden)

      + backend_pool {
          + health_probe_name   = "healthProbeSettings-div-dn"
          + load_balancing_name = "loadBalancingSettings-div-dn"
          + name                = "div-dn"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "decree-nisi-aks.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-div-da"
          + load_balancing_name = "loadBalancingSettings-div-da"
          + name                = "div-da"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "decree-absolute-aks.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-div-rfe"
          + load_balancing_name = "loadBalancingSettings-div-rfe"
          + name                = "div-rfe"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "respond-divorce-aks.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-div-pfe"
          + load_balancing_name = "loadBalancingSettings-div-pfe"
          + name                = "div-pfe"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "petitioner-frontend-aks.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-fact"
          + load_balancing_name = "loadBalancingSettings-fact"
          + name                = "fact"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "fact.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-fact-admin"
          + load_balancing_name = "loadBalancingSettings-fact-admin"
          + name                = "fact-admin"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "fact-admin.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-et-sya"
          + load_balancing_name = "loadBalancingSettings-et-sya"
          + name                = "et-sya"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "et-sya.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-paybubble"
          + load_balancing_name = "loadBalancingSettings-paybubble"
          + name                = "paybubble"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "paybubble.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-paybubble-int"
          + load_balancing_name = "loadBalancingSettings-paybubble-int"
          + name                = "paybubble-int"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "paybubble-int.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-paymentoutcome-web"
          + load_balancing_name = "loadBalancingSettings-paymentoutcome-web"
          + name                = "paymentoutcome-web"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "paymentoutcome-web.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-paymentoutcome-web-int"
          + load_balancing_name = "loadBalancingSettings-paymentoutcome-web-int"
          + name                = "paymentoutcome-web-int"

          + backend {
              + address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "paymentoutcome-web-int.demo.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }

      + backend_pool_health_probe {
          + enabled             = true
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-div-dn"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-div-da"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-div-rfe"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-div-pfe"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-fact"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-fact-admin"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-et-sya"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-paybubble"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-paybubble-int"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-paymentoutcome-web"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-paymentoutcome-web-int"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }

      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-div-dn"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-div-da"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-div-rfe"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-div-pfe"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-fact"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-fact-admin"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-et-sya"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-paybubble"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-paybubble-int"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-paymentoutcome-web"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-paymentoutcome-web-int"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }

      + frontend_endpoint {
          + host_name                               = "decree-nisi-aks.demo.platform.hmcts.net"
          + name                                    = "div-dn"
          + session_affinity_enabled                = false
          + session_affinity_ttl_seconds            = 0
          + web_application_firewall_policy_link_id = (known after apply)
        }
      + frontend_endpoint {
          + host_name                               = "decree-absolute-aks.demo.platform.hmcts.net"
          + name                                    = "div-da"
          + session_affinity_enabled                = false
          + session_affinity_ttl_seconds            = 0
          + web_application_firewall_policy_link_id = (known after apply)
        }
      + frontend_endpoint {
          + host_name                               = "respond-divorce-aks.demo.platform.hmcts.net"
          + name                                    = "div-rfe"
          + session_affinity_enabled                = false
          + session_affinity_ttl_seconds            = 0
          + web_application_firewall_policy_link_id = (known after apply)
        }
      + frontend_endpoint {
          + host_name                               = "petitioner-frontend-aks.demo.platform.hmcts.net"
          + name                                    = "div-pfe"
          + session_affinity_enabled                = false
          + session_affinity_ttl_seconds            = 0
          + web_application_firewall_policy_link_id = (known after apply)
        }
      + frontend_endpoint {
          + host_name                               = "fact.demo.platform.hmcts.net"
          + name                                    = "fact"
          + session_affinity_enabled                = false
          + session_affinity_ttl_seconds            = 0
          + web_application_firewall_policy_link_id = (known after apply)
        }
      + frontend_endpoint {
          + host_name                               = "fact-admin.demo.platform.hmcts.net"
          + name                                    = "fact-admin"
          + session_affinity_enabled                = false
          + session_affinity_ttl_seconds            = 0
          + web_application_firewall_policy_link_id = (known after apply)
        }
      + frontend_endpoint {
          + host_name                               = "et-sya.demo.platform.hmcts.net"
          + name                                    = "et-sya"
          + session_affinity_enabled                = false
          + session_affinity_ttl_seconds            = 0
          + web_application_firewall_policy_link_id = (known after apply)
        }
      + frontend_endpoint {
          + host_name                               = "paybubble.demo.platform.hmcts.net"
          + name                                    = "paybubble"
          + session_affinity_enabled                = false
          + session_affinity_ttl_seconds            = 0
          + web_application_firewall_policy_link_id = (known after apply)
        }
      + frontend_endpoint {
          + host_name                               = "paybubble-int.demo.platform.hmcts.net"
          + name                                    = "paybubble-int"
          + session_affinity_enabled                = false
          + session_affinity_ttl_seconds            = 0
          + web_application_firewall_policy_link_id = (known after apply)
        }
      + frontend_endpoint {
          + host_name                               = "paymentoutcome-web.demo.platform.hmcts.net"
          + name                                    = "paymentoutcome-web"
          + session_affinity_enabled                = false
          + session_affinity_ttl_seconds            = 0
          + web_application_firewall_policy_link_id = (known after apply)
        }
      + frontend_endpoint {
          + host_name                               = "paymentoutcome-web-int.demo.platform.hmcts.net"
          + name                                    = "paymentoutcome-web-int"
          + session_affinity_enabled                = false
          + session_affinity_ttl_seconds            = 0
          + web_application_firewall_policy_link_id = (known after apply)
        }
      + frontend_endpoint {
          + host_name                    = "www.paymentoutcome-web.demo.platform.hmcts.net"
          + name                         = "wwwpaymentoutcome-web"
          + session_affinity_enabled     = false
          + session_affinity_ttl_seconds = 0
        }
      + frontend_endpoint {
          + host_name                    = "www.paymentoutcome-web-int.demo.platform.hmcts.net"
          + name                         = "wwwpaymentoutcome-web-int"
          + session_affinity_enabled     = false
          + session_affinity_ttl_seconds = 0
        }

      ~ routing_rule {
          ~ accepted_protocols = [
              - "Http",
              + "Https",
            ]
          ~ frontend_endpoints = [
              - "reformscan",
              + "div-dn",
            ]
            id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/reformscanHttpsRedirect"
          ~ name               = "reformscanHttpsRedirect" -> "div-dn"
            # (2 unchanged attributes hidden)

          + forwarding_configuration {
              + backend_pool_name                     = "div-dn"
     

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

or       = "cookies_policy"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "__auth-token"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "iss"
            }
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["div-dn"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "divdndemo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "connect.sid"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "cookies_policy"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "__auth-token"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "session"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "iss"
            }
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["div-pfe"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "divpfedemo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "connect.sid"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "cookies_policy"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "__auth-token"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "iss"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "__auth-token"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "_csrf"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "_csrf"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "StartsWith"
              + selector       = "reasonForDivorceBehaviourDetails"
            }
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["div-rfe"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "divrfedemo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "connect.sid"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "cookies_policy"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "__auth-token"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "iss"
            }
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["et-sya"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "etsyademo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["fact"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "factdemo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "connect.sid"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "cookies_policy"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "__auth-token"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "iss"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "rxVisitor"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_ga"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_gid"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_gat"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "dtCookie"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "dtLatC"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "dtPC"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "dtSa"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "rxVisitor"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "rxvt"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "i18next"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "fact-cookie-preferences"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_oauth2_proxy"
            }
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["fact-admin"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "factadmindemo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["paybubble"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "paybubbledemo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "referer"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "iss"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "__auth-token"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "__user-info"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "__redirect"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "dtSa"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "rf"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "DecodedUrl"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "__pcipal-info"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "connect.sid"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "ccpay-bubble-cookie-preferences"
            }
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["paybubble-int"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "paybubbleintdemo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "referer"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "iss"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "__auth-token"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "__user-info"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "__redirect"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "dtSa"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "rf"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "DecodedUrl"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "__pcipal-info"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "connect.sid"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "ccpay-bubble-cookie-preferences"
            }
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["paymentoutcome-web"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "paymentoutcomewebdemo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["paymentoutcome-web-int"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "paymentoutcomewebintdemo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "frontdoor_diagnostics" {
        id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo|fd-log-analytics"
        name                       = "fd-log-analytics"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 24 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1486,"Program":"tfcmt","SHA1":"","Target":"demo-global","Vars":{}} -->